### Exercise

In exercise folder (same level as this notebook on github) there is **hiring.csv**. This file contains hiring statics for a firm such as experience of candidate, his written test score and personal interview score. Based on these 3 factors, HR will decide the salary. Given this data, you need to build a machine learning model for HR department that can help them decide salaries for future candidates. Using this predict salaries for following candidates:

```
2 yr experience, 9 test score, 6 interview score

12 yr experience, 10 test score, 10 interview score
```

In [394]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
from sklearn import linear_model
import warnings
import word2number.w2n as c
warnings.filterwarnings("ignore", category=UserWarning)

In [395]:
df = pd.read_csv('hiring.csv')

In [396]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [397]:
temp_df = df.dropna(subset=['experience', 'test_score(out of 10)'])

In [398]:
temp_df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
7     eleven                    7.0                           8      80000

In [399]:
indices = temp_df.index.tolist()
indices

[2, 3, 4, 5, 7]

In [400]:
to_nums = []
for word in temp_df['experience']:
    to_nums.append(c.word_to_num(word))
to_nums

[5, 2, 7, 3, 11]

In [401]:
count = len(temp_df)
for idx in temp_df['experience']:
    temp_df['experience'] = to_nums[[i for i in range(count)]]

TypeError: list indices must be integers or slices, not list

In [ ]:
temp_df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
7     eleven                    7.0                           8      80000